{"_id":{"$oid":"646fd63fb8d074019ae17b02"},"recipeName":"Cinnamon Rolls","ingredients":["3 cups (344g)all-purpose flour","1 cup (50g) granulated sugar","1 tsp salt","3 cups (180ml) whole milk","3 Tbsps (45g) unsalted butter","2 1/4 tsps instant yeast","1 large egg","3 Tbsps (45g) unsalted butter, extra softened","1/3 cup (67g) light or dark brown sugar","1 Tbsp ground cinnamon","4 oz (113g) full-fat block cream cheese, softened to room temperature","2 Tbsps (30g) butter, softened to room temperature","2/3 cups (80g) confectioners' sugar","1 tsp vanilla extract"],"instructions":["1. Make the dough: Whisk the flour, sugar, and salt together in a large bowl. Set aside.","2. Combine the milk and butter together in a heatproof bowl. Microwave or use the stove and heat until the butter has melted and the mixture is warm to the touch (about 110°F/43°C, no higher). Whisk in the yeast until it has dissolved. Pour mixture into the dry ingredients, add the egg, and stir with a sturdy rubber spatula or wooden spoon OR use a stand mixer with a paddle attachment on medium speed. Mix until a soft dough forms.","3. Transfer dough to a lightly floured surface. Using floured hands, knead the dough for 3 minutes. You should have a smooth ball of dough. If the dough is super soft or sticky, you can add a little more flour. Place in a lightly greased bowl (I use non-stick spray), cover loosely, and let the dough rest for about 10 minutes as you get the filling ingredients ready.","4. Fill the rolls: After 10 minutes, roll the dough out in a 14×8-inch (36×20-cm) rectangle. Spread the softened butter on top. Mix together the cinnamon and brown sugar. Sprinkle it all over the dough. Roll up the dough to make a 14-inch log. Cut into 10–12 even rolls and arrange in a lightly greased 9- or 10-inch round cake pan, pie dish, or square baking pan.","5. Rise: Cover the pan with aluminum foil, plastic wrap, or a clean kitchen towel. Allow the rolls to rise in a relatively warm environment for 60–90 minutes or until double in size.","6. Bake the rolls: After the rolls have doubled in size, preheat the oven to 375°F (190°C). Bake for 24–27 minutes, or until lightly browned. If you notice the tops are getting too brown too quickly, loosely tent the pan with aluminum foil and continue baking. If you want to be precise about their doneness, their internal temperature taken with an instant read thermometer should be around 195–200°F (91–93°C) when done. Remove pan from the oven and place pan on a wire rack as you make the icing. (You can also make the icing as the rolls bake.)","7. Make the icing: In a medium bowl using a handheld or stand mixer fitted with a paddle or whisk attachment, beat the cream cheese on high speed until smooth and creamy. Add the butter and beat until smooth and combined, then beat in the confectioners’ sugar and vanilla until combined. Using a knife or icing spatula, spread the icing over the warm rolls and serve immediately.","8. Cover leftover frosted or unfrosted rolls tightly and store at room temperature for up to 2 days or in the refrigerator for up to 5 days."]}
